app/controllers/sprints_controller.rb

SELECT "sprints".* FROM "sprints"
---
  def index
    @sprints = Sprint.all

INSERT INTO "sprints" ("created_at", "from", "name_sprint", "to", "total_days", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-08-27 14:56:23.178822"], ["from", 1234], ["name_sprint", "38"], ["to", 5678], ["total_days", 533], ["updated_at", "2014-08-27 14:56:23.178822"]]
---
  def create
    @sprint = Sprint.new(sprint_params)

    respond_to do |format|
      if @sprint.save

UPDATE "sprints" SET "from" = ?, "to" = ?, "total_days" = ?, "updated_at" = ? WHERE "sprints"."id" = 1  [["from", 1], ["to", 3], ["total_days", 2], ["updated_at", "2014-08-27 14:57:19.783174"]]
---
  def update
    respond_to do |format|
      if @sprint.update(sprint_params)

SELECT  "sprints".* FROM "sprints"  WHERE "sprints"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_sprint
      @sprint = Sprint.find(params[:id])